/*
Задача 0
Напишите программу, которая на вход принимает число и выдаёт
его квадрат (число умноженное на само себя).
*/

Console.Write("Введите число N: ");
int number = Convert.ToInt32(Console.ReadLine());
Console.Write(number*number);

